/*
    -------------------------------------
        npm i -g @nestjs/cli 로 전역 설치
    -------------------------------------

      nest 프로젝트 생성 하기
    -------------------------------------------------
      nest new 프로젝트명
    -------------------------------------------------

    그 다음 프로젝트 디렉토리로 들어가서

    ------------------------------------------------
        nest g controller Users // Users라는 컨트롤러 생성
    ------------------------------------------------


  만약 MVC를 한번에 생성하고 싶다면
  -------------------------------------------------
    nest g resource 리소스명
  -------------------------------------------------


  CLI롷 자동 생성된 프로젝트는 PATH 메서드를 쓴다. PUT은 리소스 전체를 교체할 때 쓰고, 부분 업데이트는 PATCH를 쓴다

  HTTP 응답코드 POST 일때 201, 나머지는 200이다
  

*/